20250621T094036--kdoc-401-起動中のプロセスをstraceで観察する__wiki.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-11-03T16:37:46Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 401: 起動中のプロセスをstraceで観察する</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 401: 起動中のプロセスをstraceで観察する</h1>
<div id="outline-container-org0f3574b" class="outline-2">
<h2 id="org0f3574b"><a href="#org0f3574b">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org0f3574b">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2025-06-21 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2025-06-26 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgacade75" class="outline-2">
<h2 id="orgacade75"><a href="#orgacade75">概要</a></h2>
<div class="outline-text-2" id="text-orgacade75">
<p>
<code>strace</code> ですでに起動しているプロセスを見てみると気軽に発行システムコールを眺められる。コマンドをメモしておく。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>viteの開発サーバに対してアタッチする。ホットリロードのためにポーリングがされているのがわかる</label><pre class="src src-shell">sudo strace -p $(pgrep node | head -n1)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nil">strace: Process 1550973 attached
epoll_pwait(15, [{events=EPOLLIN, data={u32=22, u64=22}}], 1024, 638, NULL, 8) = 1
read(22, "\35\0\0\0H\253\0\0\6\1\0\0\0\7\0\0\0command\3\4\0\0\0pin"..., 65536) = 33
write(20, "\t\0\0\0I\253\0\0\6\0\0\0\0", 13) = 13
epoll_pwait(15, [], 1024, 0, NULL, 8)   = 0
(略)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbd11d34" class="outline-2">
<h2 id="orgbd11d34"><a href="#orgbd11d34">関連</a></h2>
<div class="outline-text-2" id="text-orgbd11d34">
<p>
なし。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
